In [145]:
import pandas as pd

In [146]:
pathname='/Users/rishigummakonda/Documents/Springboard/capstone/data/census_tract/from_atlas/'
nyc = pd.read_csv(pathname+'nyc_tracts.csv')
la = pd.read_csv(pathname+'la_tracts.csv')
den = pd.read_csv(pathname+'denver_tracts.csv')
nash=pd.read_csv(pathname+'nashville_tracts.csv')

After being fed up with trying to find the census tract for each city through third-party sources, I decided to go back to the Oppurtunity Atlas to find the census tracts through there. There is an option to download just the data that is on the screen. Using the search tool I searched each city then proceeded to download the data. Now I have to filter each data set and create new ones that only contain census tracts of the cities

In [147]:
#Filtering nyc
nyc.head()
nyc.shape

(3425, 3)

In [148]:
nyc_names =nyc["Name"]
new_nyc = nyc[nyc_names.str.contains("New York") | nyc_names.str.contains("Queens") | nyc_names.str.contains("Bronx County")| nyc_names.str.contains("Richmond")| nyc_names.str.contains("Kings")]

In [149]:
new_nyc.head()

          tract                      Name  Household_Income_rP_gP_pall
6   36047004400          Kings County, NY                      88606.0
30  36061012800  Lenox Hill, New York, NY                      81412.0
34  36047061200          Kings County, NY                      81147.0
38  36059300100           Kings Point, NY                      80474.0
51  36081091601         Queens County, NY                      79190.0

In [150]:
nyc_tracts = list(new_nyc['tract'])
len(nyc_tracts)

2158

In [151]:
#Filtering la
la.shape

(3267, 3)

In [152]:
la.head(10)

        tract                         Name  Household_Income_rP_gP_pall
0  6037262301              Los Angeles, CA                      85044.0
1  6037265100    Westwood, Los Angeles, CA                      81626.0
2  6037574602   Bixby Hill, Long Beach, CA                      79078.0
3  6037262302   Brentwood, Los Angeles, CA                      77935.0
4  6037265420    Westwood, Los Angeles, CA                      76807.0
5  6037670500            Rolling Hills, CA                      76786.0
6  6037670406    Rolling Hills Estates, CA                      75352.0
7  6037139801     Tarzana, Los Angeles, CA                      75027.0
8  6111007406                 Oak Park, CA                      74717.0
9  6037108202  Northridge, Los Angeles, CA                      74459.0

In [153]:
la_names =la["Name"]
new_la = la[la_names.str.contains("Los Angeles")]
new_la.head()

        tract                        Name  Household_Income_rP_gP_pall
0  6037262301             Los Angeles, CA                      85044.0
1  6037265100   Westwood, Los Angeles, CA                      81626.0
3  6037262302  Brentwood, Los Angeles, CA                      77935.0
4  6037265420   Westwood, Los Angeles, CA                      76807.0
7  6037139801    Tarzana, Los Angeles, CA                      75027.0

In [154]:
la_tracts = list(new_la['tract'])
len(la_tracts)

1046

In [155]:
#filtering denver
den.head(10)

        tract                   Name  Household_Income_rP_gP_pall
0  8005005636  Greenwood Village, CO                      84820.0
1  8005006704          Englewood, CO                      80971.0
2  8005006705          Englewood, CO                      76924.0
3  8059012034           Morrison, CO                      75736.0
4  8005005622   Columbine Valley, CO                      74071.0
5  8005006808          Englewood, CO                      73436.0
6  8005006712  Greenwood Village, CO                      72731.0
7  8005006857  Greenwood Village, CO                      72394.0
8  8031003203    Central, Denver, CO                      71022.0
9  8059009848          Evergreen, CO                      70924.0

In [156]:
den_names =den["Name"]
new_den = den[den_names.str.contains("Denver")]
new_den.head()

         tract                   Name  Household_Income_rP_gP_pall
8   8031003203    Central, Denver, CO                      71022.0
12  8031004303       East, Denver, CO                      68364.0
24  8031003901    Belcaro, Denver, CO                      64503.0
34  8031006804  Southeast, Denver, CO                      62427.0
44  8005015100  Southeast, Denver, CO                      61236.0

In [157]:
denver_tracts=list(new_den['tract'])
len(denver_tracts)

168

In [158]:
#filtering nashville
nash.head(10)

         tract                              Name  Household_Income_rP_gP_pall
0  47037018601                     Nashville, TN                      78550.0
1  47037018500  Belle Meade Links, Nashville, TN                      76949.0
2  47187050305                     Brentwood, TN                      72600.0
3  47187050404                      Franklin, TN                      72037.0
4  47187050203                     Brentwood, TN                      71171.0
5  47037018700                     Nashville, TN                      70928.0
6  47187050207                     Brentwood, TN                      70725.0
7  47037017901        Green Hills, Nashville, TN                      69744.0
8  47187050303                     Brentwood, TN                      69710.0
9  47037018602     Otter Creek, Forest Hills, TN                      68533.0

In [159]:
nash_names =nash["Name"]
new_nash = nash[nash_names.str.contains("Nashville")]
new_nash.head()

          tract                              Name  Household_Income_rP_gP_pall
0   47037018601                     Nashville, TN                      78550.0
1   47037018500  Belle Meade Links, Nashville, TN                      76949.0
5   47037018700                     Nashville, TN                      70928.0
7   47037017901        Green Hills, Nashville, TN                      69744.0
11  47037017902        Green Hills, Nashville, TN                      67405.0

In [160]:
nashville_tracts=list(new_nash['tract'])
len(nashville_tracts)

154

In [161]:
#List of all codes
all_codes=nyc_tracts+la_tracts+denver_tracts+nashville_tracts

In [162]:
len(all_codes)

3526

This is when I realize that all the codes I got from the Oppurtunity Atlas are not exactly the census tract. I forgot to include this very important part in my project proposal:
Hint: The Opportunity Atlas website will give you the tract, county, and state FIPS codes for your home address. For example, searching for “Lynwood Road, Verona, New Jersey” will display Tract 34013021000, Verona, NJ. The first two digits refer to the state code, the next three digits refer to the county code, and the last 6 digits refer to the tract code.

In [163]:
#Now I need to alter each element in all_codes to have just the tracts

In [164]:
all_tracts =[]
tract = ""
for code in all_codes:
    code = str(code)
    tract =code[-6:]
    all_tracts.append(tract)

In [168]:
len(all_tracts)

3526

In [170]:
atlas[atlas['tract'].isin(all_tracts)].shape

(25159, 63)

^ That is when I realize that I have to filter by state and county too

In [171]:
all_tracts =[]
all_states =[]
all_county =[]
tract = ""
state=""
county=""
for code in all_codes:
    code = str(code)
    tract =code[-6:]
    state =code[:-9]
    
    all_tracts.append(tract)

In [167]:
#import atlas.csv
atlas = pd.read_csv('/Users/rishigummakonda/Documents/Springboard/capstone/data/atlas_data/atlas.csv')

In [169]:
for tract in atlas['tract']:
    tract = str(tract)